{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e3a93c30",
   "metadata": {},
   "source": [
    "# Примеры работы с условным оператором if, циклами for и while, некоторые методы работы со списками, генераторы списков"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f84c2be8",
   "metadata": {},
   "source": [
    "## Задача 1. Цикл for, условный оператор if, списки\n",
    "**Входные данные**\n",
    "В первой строке входного файла INPUT.TXT записано натуральное число N (1 ≤ N ≤ 100) – число монеток. В каждой из последующих N строк содержится одно целое число – 1 если монетка лежит решкой вверх и 0 если вверх гербом.\n",
    "\n",
    "**Выходные данные**\n",
    "В выходной файл OUTPUT.TXT выведите минимальное количество монет, которые нужно перевернуть."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8b2a4298",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n",
      "0\n",
      "0\n",
      "0\n",
      "1\n",
      "Количество монеток, которое нужно перевернуть: 1\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "lst = []\n",
    "for i in range (0,n):\n",
    "    m = int(input()) \n",
    "    lst.append(m) #добавление элементов в список\n",
    "\n",
    "money_zero = 0\n",
    "money_one = 0\n",
    "for i in lst:\n",
    "    if i == 0:\n",
    "        money_zero += 1\n",
    "    else:\n",
    "        money_one += 1\n",
    "if money_zero < money_one:      \n",
    "    print('Количество монеток, которое нужно перевернуть:', money_zero)\n",
    "else:\n",
    "    print('Количество монеток, которое нужно перевернуть:', money_one)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0873d0f2",
   "metadata": {},
   "source": [
    "## Задача 2. Цикл for, условный оператор if, списки, операторы break, continue\n",
    "\n",
    "Напишите программу, реализующую алгоритм перевода целого положительного числа NN из двоичной системы счисления в десятичную.\n",
    "\n",
    "**На вход программе** подаётся число NN, представленное в двоичной системе счисления.\n",
    "\n",
    "**Программа должна вывести** число NN, представленное в десятичной системе счисления."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "58a4b3d7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11100010\n",
      "226\n"
     ]
    }
   ],
   "source": [
    "num = input()\n",
    "num = num[::-1] #строка в обратном порядке\n",
    "n = len(num) #подсчет символов в строке\n",
    "k = 0 #переменная индекса и степени\n",
    "s = 0 #переменная для записи десятичных значений\n",
    "lst = [] #список, чтобы посчитать десятичные значения потом\n",
    "for i in range(n):\n",
    "    if num[k] == '1': #важно понимать, что мы работаем с данными типа СТРОКА, поэтому кавычки\n",
    "        s = 2**k\n",
    "        lst.append(s) \n",
    "        k+=1\n",
    "    else:\n",
    "        k+=1\n",
    "        continue\n",
    "lst = [int(i) for i in lst] #генератор списка\n",
    "summ = sum(lst)\n",
    "print(summ)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ca0f0ab",
   "metadata": {},
   "source": [
    "## Задача 3. Применение цикла while, логические операторы \n",
    "\n",
    "Напишите программу, которая считывает целые числа с консоли по одному числу в строке.\n",
    "\n",
    "Для каждого введённого числа проверить:\n",
    "если число меньше 10, то пропускаем это число;\n",
    "если число больше 100, то прекращаем считывать числа;\n",
    "в остальных случаях вывести это число обратно на консоль в отдельной строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "e78178d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n",
      "5\n",
      "15\n",
      "15\n",
      "99\n",
      "99\n",
      "100\n",
      "100\n",
      "109\n"
     ]
    }
   ],
   "source": [
    "while True:\n",
    "    a=int(input())\n",
    "    if a<10:\n",
    "        continue\n",
    "    elif a>100:\n",
    "        break\n",
    "    else:\n",
    "        print (a)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "447e2f5c",
   "metadata": {},
   "source": [
    "## Задача 4. Применение цикла while, генератор списка\n",
    "\n",
    "Напишите программу, которая **считывает с консоли числа** (по одному в строке) до тех пор, **пока сумма введённых чисел не будет равна 0** и сразу после этого выводит сумму квадратов всех считанных чисел.\n",
    "\n",
    "Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.\n",
    "\n",
    "В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a3d510cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = [int (i) for i in input().split()] #пользователь вводит значение, оно заносится в список а\n",
    "s = sum(a) #ввели переменную, в которой будут накапливаться введенные пользователем значения\n",
    "while s!=0: #пока накопитель не равен нулю, выполняется следующий цикл\n",
    "    a.append(int(input())) #пользователь добавляет значение в список а\n",
    "    s=sum(a) #сумматор суммирует значения\n",
    "x = [i*i for i in (a)] #список квадратов значений\n",
    "Xn = sum (x) #сумматор квадратов значений\n",
    "print (Xn)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
