{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d13c9b2c",
   "metadata": {},
   "source": [
    "# Строки, символы, списки"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "65d7789c",
   "metadata": {},
   "source": [
    "## Задача 1. Строки, методы строк\n",
    "\n",
    "GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности.\n",
    "\n",
    "Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть от регистра вводимых символов).\n",
    "\n",
    "Например, в строке \"acggtgttat\" процентное содержание символов G и C равно $$ {4 \\over 10} ⋅ 100=40.0, $$ где 4 -- это количество символов G и C,  а 10 -- это длина строки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "46ea674a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "gcgcac\n",
      "83.33333333333334\n"
     ]
    }
   ],
   "source": [
    "g=input()\n",
    "a=g.count('G')\n",
    "b=g.count('g')\n",
    "c=g.count('C')\n",
    "d=g.count('c')\n",
    "s=len(g)\n",
    "sum=((a+b+c+d)/s)*100\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6da124ef",
   "metadata": {},
   "source": [
    "## Задача 2. Строки, методы строк\n",
    "### Задание 3.\n",
    "\n",
    "Пользователь вводит с клавиатуры список из N слов разной длины. Необходимо создать новый список из слов одинаковой длины. За результирующую длину слова выбирается длина самого длинного слова в исходном списке. Короткие слова дополняются до нужной длины необходимым количеством символов * в конце. Вывести на экран новый список с сохранением исходной последовательности слов.  \n",
    "Например,  \n",
    "исходный список: $$кот; собака; гусь; кабан$$  \n",
    "результирующий список: $$кот***; собака; гусь**; кабан*$$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "7a20ba61",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "кот;собака;гусь;кабан\n",
      "кот***;собака;гусь**;кабан*\n"
     ]
    }
   ],
   "source": [
    "st = input().split(';')\n",
    "l = len(st) #количество строк в списке\n",
    "max_string = max(st, key=len) #находим самую длинную строку\n",
    "l_max_s = len(max_string) # находим длину самой длинной строки\n",
    "k= 0 #количество символов в строке\n",
    "n=0 #номер строки\n",
    "#перебираем каждую строку\n",
    "#проверяем её длину\n",
    "#добавляем звёздочки\n",
    "for i in range (l):\n",
    "    if len(st[n])<l_max_s:\n",
    "        st[n]+='*'*(l_max_s-len(st[n]))\n",
    "        n+=1\n",
    "    else: \n",
    "        n+=1\n",
    "        \n",
    "print(*st, sep=';')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61ce11bf",
   "metadata": {},
   "source": [
    "## Задача 3. Строки и списки\n",
    "\n",
    "С клавиатуры вводится предложение (слова, разделённые пробелом; цифр и знаков препинания нет, кроме точки в конце предложения).\n",
    "Например, \"Какой прекрасный день.\"\n",
    "Необходимо найти самое длинное слово и вывести на экран это слово и его длину. В примере это: прекрасный - 10.\n",
    "\n",
    "1) Решить задачу без использования списков (list), методов строк (методы split(), len() и другие нельзя) и других встроенных методов языка (напремер, max), введённая строка рассматривается как одно целое; использовать циклы и условия.\n",
    "\n",
    "2) Решить задачу с использованием методов строк (можно любые методы). Можно использовать списки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "047bd82a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какой прекрасный день\n",
      "прекрасный-10\n"
     ]
    }
   ],
   "source": [
    "#Решение без использования списков\n",
    "\n",
    "st=input() #пользователь ввёл предложение, как одну строку\n",
    "l=len(st)\n",
    "st = st[0:l-1] #избавляемся от точки\n",
    "l=len(st) #посчитали количество симфволов в предложении, !!!включая пробелы!!!\n",
    "count = 0 #счетчик букв в слове\n",
    "indx = 0 # для print(st[indx:indx+max]), индекс начала слова\n",
    "mmax = 0 #слово максимальной длины для вывода\n",
    "\n",
    "for i in range(l): #перебираем все символы строки\n",
    "   \n",
    "    if st[i]!= ' ': #делим предложение по пробелам на слова, \n",
    "        count +=1   #чтобы посчитать в цикле каждое\n",
    "    \n",
    "    else:           #дошли до пробела     \n",
    "        if count > mmax: #если текущее слово больше Максимального\n",
    "            mmax= count #это слово становится максимальным\n",
    "            indx = i - count #индекс начала слова\n",
    "        count = 0 #обнуляем счётчик букв в слове\n",
    "\n",
    "if count > mmax: #если последнее слово оказалось самым длинным\n",
    "    mmax= count #это слово становится максимальным\n",
    "    indx = i - count+1 #индекс начала слова, \n",
    "                       #+1, чтобы не потерять последнюю букву\n",
    "print(st[indx:indx+mmax], mmax, sep = '-')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a7ac1891",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какой прекрасный день\n",
      "прекрасный-10\n"
     ]
    }
   ],
   "source": [
    "#Решение с использованием списков\n",
    "\n",
    "st = input().split(' ') #список разделён по пробелам\n",
    "l = len(st) #сколько строк в списке\n",
    "l_n =len (st[l-1]) #длина последней строки в списке\n",
    "st[l-1]=st[l-1][0:l_n-1] #удаляем точку из последней строки\n",
    "\n",
    "max_string = max(st, key=len)\n",
    "\n",
    "print (max_string, len(max_string), sep = '-' )"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
